export const webcomponentsCollection = {
	name: "3rd grade curriculum",
	areas: [
	   {
		  name: "1st semester_required",
		  skills: [
					{
						name: "컴퓨터구조",
						description: {
						text: "디지털 컴퓨터를 구성하는 주요 구성 요소들의 기능과 그들 상호간의 작용을 이해하고 이를 바탕으로 컴퓨터 시스템을 구현하는데 사용되는 여러 설계 기법들을 학습한다. ",
						},
					},
					{
						name: "창업기획",
						description: {
						text: "대학생활 전주기적인 관점에서 창업에 관한 진로 설계를 졸업 후를 대비 체계적으로 수립할 수 있는 능력을 배양한다. ",
						},
					},
					{
						name: "운영체제",
						description: {
						text: "운영체제의 역할과 설계 및 구축 방법을 학습한다.",
						},
					},
					{
						name: "프로그래밍 언어론",
						description: {
						text: "프로그래밍 언어의 발전과정, 개념, 그리고 설계 및 구현 기법을 강의함으로써, 프로그래밍언어의 사용 능력을 향상시키고, 새로운 프로그래밍언어의 설계 및 구현 능력을 배양한다.",
						},
					},
					
			]
		},
		{
			name: "1st semester_elective",
			skills: [
					  {
						  name: "응용수학",
						  description: {
						  text: "기초적인 수리적 개념을 바탕으로 컴퓨터공학 분야에서 요구되는 응용문제를 해결하기 위한 내용을 학습한다. ",
						  },
					  },
					  {
						  name: "알고리즘",
						  description: {
						  text: "점근적 표기, 복잡도 분석 등의 기초 개념을 기반으로 하여 다양한 문제 해결에 사용하는 알고리즘을 자료구조와 연계하여 학습하고, 알고리즘의 성능 분석 및 설계와 관련한 공학적 문제들을 학습한다.",
						  },
					  },
					  {
						  name: "오픈소스전문프로젝트",
						  description: {
						  text: "오픈소스 라이브러리 및 관련 도구를 활용하여 웹과 앱 상에서 실행되는 어플리케이션을 구현하여 보고, 소프트웨어 개발의 분석 및 설계 과정을 이해한다.",
						  },
					  },
			  ]
		  },
		{
		  name: "2nd semester_required",
		  skills: [
					{
						name: "창업설계",
						description: {
						text: "4차 산업 혁명과 관련된 기술 동향을 파악하고 창업에 관련된 실무 경험을 수행한다.",
						},
					},
					{
						name: "산학프로젝트",
						description: {
						text: "공학적 탐구방법과 과정을 익히기 위한 목적을 가지고 정의된 주제에 대하여 기술 동향 및 시장 동향, 그리고 기술적 해결 방안 등을 제시하며, 보고서 작성 및 발표를 통해 효과적인 협업과 효율적인 커뮤니케이션을 달성함으로써 성공적인 프로젝트 수행을 위한 기본 능력을 배양한다.",
						},
					},

			]
		},
		{
			name: "2nd semester_elective",
			skills: [
					  {
						  name: "마이크로프로세서",
						  description: {
						  text: "마이크로프로세서의 구성과 명령어의 이해를 통해 이를 이용한 시스템의 해석과 설계 능력을 학습한다. 메모리 시스템, 입출력 및 버스 등의 구조를 강조하여 소개하여, 내장형 시스템 전체의 하드웨어의 이해와 설계 능력을 배양하는데 그 목표를 둔다.",
						  },
					  },
					  {
						  name: "정보보호",
						  description: {
						  text: "공격의 유형, 보안 서비스, 접근 통제, 대칭키 암호 알고리즘, 공개키 암호 알고리즘, 전자 서명, 해시 알고리즘, PKI, DDoS 공격, 트래픽 공격 탐지, 침입 차단 시스템, 침입 탐지 시스템, 가상 사설망, IPsec 등 정보 보호에 대하여 학습한다.",
						  },
					  },
					  {
						name: "소프트웨어공학",
						description: {
						text: "고품질의 소프트웨어 시스템을 비용 효율적으로 명세, 설계, 구축, 테스팅, 배포하기 위해 필요한 일반적인 소프트웨어 공학 문제들을 다룬다. 학생들은 소프트웨어 재사용, 아키텍처 설계, 의존성, 보안 등과 같은 소프트웨어공학에서의 기본적 개념에 대해서도 학습하게 된다.",
						},
					},
					{
						name: "데이터베이스시스템",
						description: {
						text: "각종 정보를 효율적으로 관리하기 위한 데이터베이스 시스템에 대한 내용을 학습한다. 데이터 모델링 기법, 데이터베이스의 구조, 관계 데이터베이스의 표준질의어인 SQL 및 정규화, 동시성 제어, 복구 기법 등의 데이터베이스 설계 비법에 관하여 공부한다.",
						},
					},
					{
						name: "인공지능",
						description: {
						text: "인공지능의 개념과 활용 분야를 살펴보고 인공지능의 핵심 이론인 탐색, 최적화, 지식표현 방법 및 추론, 지식기반 시스템, 머신러닝과 인공신경망 등의 기본 개념을 학습한다.",
						},
					},
  
			  ]
		  },
	]
 } 