export const webcomponentsCollection = {
	name: "4th grade curriculum",
	areas: [
	   {
		  name: "1st semester_required",
		  skills: [
					{
						 name: "캡스톤디자인",
                         description: {
                         text: "학생들이 팀을 위한 컴퓨터 과학 및 엔지니어링 프로젝트에 참가할 수 있는 수업입니다. 문제 정의, 솔루션 발견, 소프트웨어와 하드웨어의 계획 및 구현이 프로젝트에 포함되며, 학생은 다양한 종류의 툴을 실용화하는 것을 장려받고 있습니다.",
                         },
					},
			]
		},
		{
			name: "1st semester_elective",
			skills: [
					  {
						  name: "머신러닝",
                          description: {
                          text: "머신러닝은 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야입니다. 학생들은 머신러닝 분야의 기본적인 개념과 알고리즘 및 실제 문제에 응용하는 방법을 학습하게 됩니다.",
                          },
					  },
					  {
						  name: "사이버물리시스템",
                          description: {
                          text: "학생들이 OSI 7 layer 및 새로운 통신기반 시스템 기술을 학습할 수 있는 수업입니다.",
                          },
					  },
					  {
						  name: "소프트웨어실전영어",
                          description: {
                          text: "학생들은 컴퓨터 공학과의 주요 핵심 교과목에 나오는 용어와 개념들을 영어로 학습하게 됩니다.",
                          },
					  },
					  {
						   name: "창업산학초청세미나 1",
                           description: {
                           text: "학생들은 취업교육 및 산업체 전문가의 특강을 통해 취업준비, 산업체에서 요구되는 능력, 기업의 기술 개발 동향 및 창업에 대해 배울 수 있습니다.",
                           },
					  },
					  {
						  name: "컴퓨터비전",
                          description: {
                          text: "학생들은 이 수업을 통해 영상처리의 기본개념을 이해하여, 컴퓨터비전을 위한 시스템의 설계능력을 기를 수 있습니다.",
                          },
					  },
					  {
						  name: "컴퓨터 교재연구 및 지도법",
                          description: {
                          text: "학생들은 이 수업을 통해 학교 현장에서 사용되고 있는 정보교과서의 내용을 분석, 재구성하고 학습지도안을 작성하여 실제 연구수업을 실시할 수 있습니다.",
                          },
					  },
					  {
						  name: "분산컴퓨팅시스템",
                          description: {
                          text: "학생들은 이 수업을 통해 분산 컴퓨팅 시스템과 관련된 오퍼레이팅 시스템 및 엔지니어링에 필요한 중요 개념 및 기술들에 대해서 학습할 수 있습니다.",
                          },
					  },
			  ]h
		  },

		{
			name: "2nd semester_elective",
			skills: [
					  {
						  name: "인공신경망",
                          description: {
						  text: "인공신경망은 사람 또는 동물 두뇌의 신경망에 착안하여 구현된 컴퓨팅 시스템으로, 학생들은 이 수업을 통해 인공신경망의 일반적인 기술에 대해 학습할 수 있습니다.",
						  },
					  },
					  {
						name: "자연언어처리",
						description: {
						text: "학생들은 이 수업을 통해 인간언어처리의 과정을 이해하여, 간단한 자연언어처리 시스템을 설계하고 구현할 수 있습니다.",
						},
					  },
					  {
						name: "데이터마이닝",
						description: {
						text: "학생들은 이 수업을 통해 데이터 속성 및 데이터 전처리 기법을 배우고 분류와 군집의 고급 기법 등 데이터로부터 의미있는 패턴을 발견하는데 필요한 데이터마이닝 이론을 학습할 수 있습니다.",
						},
					  },
					  {
						name: "빅데이터",
						description: {
						text: "학생들은 이 수업을 통해 빅데이터의 의미, 활용분야, 전망과 빅데이터를 처리 및 분석하는 데에 필요한 기술을 습득할 수 있습니다.",
						},
					  },
					  {
						name: "클라우드컴퓨팅",
						description: {
						text: "학생들은 이 수업을 통해 클라우드의 유형, 특징, 장점과 클라우드 컴퓨팅의 미래에 대해 학습할 수 있습니다.",
						},
					  },
                     {
						name: "클라우드컴퓨팅",
						description: {
						text: "학생들은 이 수업을 통해 클라우드의 유형, 특징, 장점과 클라우드 컴퓨팅의 미래에 대해 학습할 수 있습니다.",
						},
					  },
					  {
						name: "창업파일럿프로젝트",
						description: {
						text: "학생들은 이 수업을 통해 실무기반 프로젝트 수행 능력을 배양하고, 실무 중심의 기술에 대한 현장에서의 적응능력을 제고할 수 있습니다.",
						},
					  },
					  {
						name: "창업산학초청세미나 2",
						description: {
						text: "학생들은 취업교육 및 산업체 전문가의 특강을 통해 취업준비, 산업체에서 요구되는 능력, 기업의 기술 개발 동향 및 창업에 대해 배울 수 있습니다.",
                        },
					  },
					  {
						name: "컴퓨터논리 및 논술",
						description: {
						text: "학생들은 이 수업을 통해 컴퓨터 교육의 이론 및 실제의 논리적인 사고방법 및 분석방법, 분석 결과에 대한 논리적 서술방법에 대해 할습할 수 있습니다.",
						}
					  },

			  ]
		  },
	]
 }